Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адресс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДисконтнойКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПользователей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Comment>Дата выдачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Comment>Дата изъятия</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Дата регистрации в системе</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГендернаяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоследнееПоздравление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентУточняемый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЧленыСемьи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыИнформационныхКарт</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дисконтная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыИнформационныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыИнформационныхКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>ВидыДисконтныхКарт</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>OnLine</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диск</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Локальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Накопительная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПоУсловию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМонетарности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыМонетарности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИнформационныеКарты/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если (ВидФормы = "ФормаОбъекта") Тогда
		СтандартнаяОбработка = Ложь;
		
		Если (ПолучитьСвойство(Параметры, "Ключ", Справочники.ИнформационныеКарты.ПустаяСсылка()).ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная) Или
			 (ТипЗнч(ПолучитьСвойство(Параметры, "Основание")) = Тип("СправочникСсылка.Пользователи")) Или
			 (Параметры.Свойство("ЗначенияЗаполнения") И ПолучитьСвойство(Параметры.ЗначенияЗаполнения, "ТипКарты") = Перечисления.ТипыИнформационныхКарт.Регистрационная) Тогда
			 ВыбраннаяФорма = "ФормаЭлементаРегистрационнаяКарта"; 
		Иначе
			 ВыбраннаяФорма = "ФормаЭлементаДисконтнаяКарта"; 
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры // ОбработкаПолученияФормы()


Функция НайтиПоКодуКарты(КодКарты) Экспорт
	
	// Поиск.
	Возврат Справочники.ИнформационныеКарты.НайтиПоРеквизиту("КодКарты", КодКарты);

КонецФункции // НайтиПоКодуКарты()


Функция ДобавитьРегистрационнуюКарту(КодКарты, ВидКарты = Неопределено, ВладелецКарты, ГруппаПользователей) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	РегистрационнаяКартаСсылка = НайтиПоКодуКарты(КодКарты);
	Если ЗначениеЗаполнено(РегистрационнаяКартаСсылка) Тогда
		РегистрационнаяКартаОбъект = РегистрационнаяКартаСсылка.ПолучитьОбъект();
	Иначе
		РегистрационнаяКартаОбъект = Справочники.ИнформационныеКарты.СоздатьЭлемент();
	КонецЕсли;
	РегистрационнаяКартаОбъект.КодКарты = КодКарты;
	РегистрационнаяКартаОбъект.ВидКарты = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(ВидКарты, Перечисления.ВидыИнформационныхКарт.Магнитная);
	РегистрационнаяКартаОбъект.ТипКарты = Перечисления.ТипыИнформационныхКарт.Регистрационная;
	РегистрационнаяКартаОбъект.ВладелецКарты = ВладелецКарты.Ссылка;
	РегистрационнаяКартаОбъект.ГруппаПользователей = ГруппаПользователей;
	РегистрационнаяКартаОбъект.ПометкаУдаления = Ложь;
	
	РегистрационнаяКартаОбъект.Записать();

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РегистрационнаяКартаОбъект.Ссылка;
	
КонецФункции // ДобавитьРегистрационнуюКарту()

Процедура УдалитьРегистрационнуюКарту(КодКарты, Удалить = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если (ТипЗнч(КодКарты) = Тип("СправочникСсылка.ИнформационныеКарты")) Тогда
		РегистрационнаяКартаСсылка = КодКарты;
	Иначе
		РегистрационнаяКартаСсылка = НайтиПоКодуКарты(КодКарты);
	КонецЕсли; 
	Если ЗначениеЗаполнено(РегистрационнаяКартаСсылка) Тогда
		РегистрационнаяКартаОбъект = РегистрационнаяКартаСсылка.ПолучитьОбъект();
		РегистрационнаяКартаОбъект.ВладелецКарты = Справочники.Пользователи.ПустаяСсылка();
		РегистрационнаяКартаОбъект.ГруппаПользователей = Неопределено;
		РегистрационнаяКартаОбъект.ПометкаУдаления = РегистрационнаяКартаОбъект.ПометкаУдаления Или Удалить;
		
		РегистрационнаяКартаОбъект.Записать();
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // УдалитьРегистрационнуюКарту()





Процедура СоздатьЗаписьВСправочнике(CODE, CODESTR, NAME, TIP, DISC, CHECKCARD, OLDCODE, PERCENT, SUM, ВидКарты ,ТипКарты ,СтрАнализа ) Экспорт 
	
	Если TIP = 2 Тогда
		СтрАнализа.Удаленных = СтрАнализа.Удаленных + 1;
	КонецЕсли;
	
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("КодКарты", CODE);
	Запрос.УстановитьПараметр("Диск", DISC);	
	Запрос.УстановитьПараметр("ВладелецКарты", NAME);	
	//Запрос.УстановитьПараметр("ПроцентУточняемый", ЧИСЛО(PERCENT));
	//Костенюк Александр-Старт 02.04.2012
	Если ЗначениеЗаполнено(PERCENT) Тогда
		Запрос.УстановитьПараметр("ПроцентУточняемый", ЧИСЛО(PERCENT));
	Иначе
		Запрос.УстановитьПараметр("ПроцентУточняемый", "");
	КонецЕсли;
	//Костенюк Александр-Финиш 02.04.2012
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДКарты.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ДКарты.ВладелецКарты = &ВладелецКарты
	               |			ТОГДА ВЫБОР
	               |					КОГДА ДКарты.ВидДисконтнойКартыДиск = &Диск
	               |						ТОГДА ВЫБОР
	               |								КОГДА ДКарты.ПроцентУточняемый = &ПроцентУточняемый
	               |									ТОГДА ЛОЖЬ
	               |								ИНАЧЕ ИСТИНА
	               |							КОНЕЦ
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Проверка
	               |ИЗ
	               |	(ВЫБРАТЬ ПЕРВЫЕ 1
	               |		ИнформационныеКарты.Ссылка КАК Ссылка,
	               |		ИнформационныеКарты.ВидДисконтнойКарты.Диск КАК ВидДисконтнойКартыДиск,
	               |		ИнформационныеКарты.ВладелецКарты КАК ВладелецКарты,
	               |		ИнформационныеКарты.ПроцентУточняемый КАК ПроцентУточняемый
	               |	ИЗ
	               |		Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	               |	ГДЕ
	               |		ИнформационныеКарты.КодКарты = &КодКарты) КАК ДКарты";
	
	Результат =  Запрос.Выполнить();	  
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);	  
	
	Если Выборка.Следующий() Тогда 	  	  
		Если Выборка.Проверка Тогда
			НовыйСправочник = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			Возврат;
		КонецЕсли;	  
	Иначе 
		СтрАнализа.Новых  =  СтрАнализа.Новых + 1;
		НовыйСправочник = Справочники.ИнформационныеКарты.СоздатьЭлемент();
		НовыйСправочник.УстановитьНовыйКод();
	КонецЕсли;
	
	Если ПустаяСтрока(НовыйСправочник.Код) Тогда 
		НовыйСправочник.УстановитьНовыйКод();  
	КонецЕсли;
	
	НовыйСправочник.Наименование = "№"+ CODE;
	НовыйСправочник.ВидДисконтнойКарты = Справочники.ВидыДисконтныхКарт.ПолучитьВидДисконтнойКарты(TIP, DISC);
	НовыйСправочник.ВидКарты  = ВидКарты;
	НовыйСправочник.КодКарты  = CODE;
	НовыйСправочник.ВладелецКарты = NAME;
	НовыйСправочник.ТипКарты  =  ТипКарты;
	//НовыйСправочник.ПроцентУточняемый = Число(PERCENT);
	//Костенюк Александр-Старт 02.04.2012
	Если ЗначениеЗаполнено(PERCENT) Тогда
		НовыйСправочник.ПроцентУточняемый = Число(PERCENT);
	КонецЕсли;
	//Костенюк Александр-Финиш 02.04.2012
	
	Попытка 
		НовыйСправочник.ОбменДанными.Загрузка =Истина;
		НовыйСправочник.Записать();  
	Исключение  
		
	КонецПопытки;
	
КонецПроцедуры

Функция НайтиЭлементВСправочнике(CODE) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодКарты", CODE);	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИнформационныеКарты.Ссылка
	|ИЗ
	|	Справочник.ИнформационныеКарты КАК ИнформационныеКарты
	|ГДЕ
	|	ИнформационныеКарты.КодКарты = &КодКарты";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.ИнформационныеКарты.ПустаяСсылка();
	Иначе 
		Возврат Результат.Выгрузить()[0].Ссылка;
	КонецЕсли;	 	
	
КонецФункции

//Костенюк Александр-Старт 05.07.2012
// Процедура производит заполнение реквизитов справочника
// 
// Параметры
// СправочникОбъект - Тип: СправочникОбъект.ИнформационныеКарты
// СтруктураРеквизитов - Тип: Структура, значения реквизитов, которые подлежат заполнению
// 
Процедура ЗаполнитьРеквизитыЭлементаСправочника(СправочникОбъект, СтруктураРеквизитов) Экспорт
	
	//СправочникОбъект.Наименование 		= "№ "+ СтруктураРеквизитов.КодКарты;
	ЗаполнитьЗначенияСвойств(СправочникОбъект, СтруктураРеквизитов);
	
КонецПроцедуры
//Костенюк Александр-Финиш 05.07.2012
